InformationRegisters/омг_СвязьУслугИПоказателейИсследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_СвязьУслугИПоказателейИсследований</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураМедицинскихУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.омг_ПоказателиИсследования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_СвязьУслугИПоказателейИсследований/Forms/ФормаЗаполненияСвязи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") И Не Параметры.Ключ.Пустой() Тогда
		Услуга = Параметры.Ключ.Услуга;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	омг_СвязьУслугИПоказателейИсследований.Услуга КАК Услуга,
		               |	омг_СвязьУслугИПоказателейИсследований.Показатель КАК Показатель
		               |ИЗ
		               |	РегистрСведений.омг_СвязьУслугИПоказателейИсследований КАК омг_СвязьУслугИПоказателейИсследований
		               |ГДЕ
		               |	омг_СвязьУслугИПоказателейИсследований.Услуга = &Услуга";
		Запрос.УстановитьПараметр("Услуга", Услуга);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Показатели.Добавить().Показатель = Выборка.Показатель;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	НаборЗаписей = РегистрыСведений.омг_СвязьУслугИПоказателейИсследований.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Услуга.Установить(Услуга);
	
	ТЗ_Показатели = Показатели.Выгрузить();
	ТЗ_Показатели.Свернуть("Показатель");
	
	Для Каждого СтрокаПоказателей Из ТЗ_Показатели Цикл
		Если СтрокаПоказателей.Показатель.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Запись = НаборЗаписей.Добавить();
		Запись.Услуга = Услуга;
		Запись.Показатель = СтрокаПоказателей.Показатель;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьФорму(Команда)
	ЗаписатьИЗакрытьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры
